app/controllers/notes_controller.rb

  def index
    @notes = Note.where(user_id: current_user)
---
SELECT "notes".* FROM "notes" WHERE "notes"."user_id" = 1

  def create
    @note = current_user.notes.build(note_params)

    if @note.save
---
INSERT INTO "notes" ("title", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "This note should have user"], ["content", "Mad skillz broz"], ["created_at", 2017-04-09 15:11:12 UTC], ["updated_at", 2017-04-09 15:11:12 UTC], ["user_id", 1]]

  def update
    if @note.update(note_params)
---
UPDATE "notes" SET "title" = ?, "updated_at" = ? WHERE "notes"."id" = ?  [["title", "Another Note Edited"], ["updated_at", 2017-04-09 10:28:06 UTC], ["id", 2]]

  def find_note
    @note = Note.find(params[:id])
---
SELECT  "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]